apple/swift-embedded-examples/Tools/SVDs/stm32f7x6.patched.svd
        <register>
          <name>DCKCFGR2</name>
          <displayName>DKCFGR2</displayName>
          <description>dedicated clocks configuration           register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>USART1SEL</name>
              <description>USART 1 clock source               selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>USART1SEL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>APB2</name>
                  <description>APB2 clock (PCLK2) is selected as USART clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>System clock is selected as USART clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI clock is selected as USART clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE clock is selected as USART clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART2SEL</name>
              <description>USART 2 clock source               selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>USART2SEL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>APB1</name>
                  <description>APB1 clock (PCLK1) is selected as USART clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>System clock is selected as USART clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI clock is selected as USART clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE clock is selected as USART clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART3SEL</name>
              <description>USART 3 clock source               selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="USART2SEL.USART2SEL"/>
            </field>
            <field>
              <name>UART4SEL</name>
              <description>UART 4 clock source               selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="USART2SEL.USART2SEL"/>
            </field>
            <field>
              <name>UART5SEL</name>
              <description>UART 5 clock source               selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="USART2SEL.USART2SEL"/>
            </field>
            <field>
              <name>USART6SEL</name>
              <description>USART 6 clock source               selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="USART1SEL.USART1SEL"/>
            </field>
            <field>
              <name>UART7SEL</name>
              <description>UART 7 clock source               selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="USART2SEL.USART2SEL"/>
            </field>
            <field>
              <name>UART8SEL</name>
              <description>UART 8 clock source               selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="USART2SEL.USART2SEL"/>
            </field>
            <field>
              <name>I2C1SEL</name>
              <description>I2C1 clock source               selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>I2C1SEL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>APB</name>
                  <description>APB clock selected as I2C clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>System clock selected as I2C clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI clock selected as I2C clock</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C2SEL</name>
              <description>I2C2 clock source               selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="I2C1SEL.I2C1SEL"/>
            </field>
            <field>
              <name>I2C3SEL</name>
              <description>I2C3 clock source               selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="I2C1SEL.I2C1SEL"/>
            </field>
            <field>
              <name>I2C4SEL</name>
              <description>I2C4 clock source               selection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="I2C1SEL.I2C1SEL"/>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <description>Low power timer 1 clock source               selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>LPTIM1SEL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>APB1</name>
                  <description>APB1 clock (PCLK1) selected as LPTILM1 clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSI</name>
                  <description>LSI clock is selected as LPTILM1 clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI clock is selected as LPTILM1 clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE clock is selected as LPTILM1 clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CECSEL</name>
              <description>HDMI-CEC clock source               selection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CECSEL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>LSE</name>
                  <description>LSE clock is selected as HDMI-CEC clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_Div488</name>
                  <description>HSI divided by 488 clock is selected as HDMI-CEC clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CK48MSEL</name>
              <description>48MHz clock source               selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CK48MSEL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>PLL</name>
                  <description>48MHz clock from PLL is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLLSAI</name>
                  <description>48MHz clock from PLLSAI is selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMMC1SEL</name>
              <description>SDMMC clock source               selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SDMMC1SEL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>CK48M</name>
                  <description>48 MHz clock is selected as SD clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>System clock is selected as SD clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
