apple/swift-embedded-examples/Tools/SVDs/stm32f7x6.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOA</name>
      <description>General-purpose I/Os</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MODER</name>
          <displayName>MODER</displayName>
          <description>GPIO port mode register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xA8000000</resetValue>
          <fields>
            <field>
              <name>MODER15</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER14</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER13</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER12</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER11</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER10</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER9</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER8</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER7</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER6</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER5</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER4</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER3</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER2</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER1</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODER0.MODER0"/>
            </field>
            <field>
              <name>MODER0</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MODER0</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Input mode (reset state)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>General purpose output mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Alternate</name>
                  <description>Alternate function mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Analog</name>
                  <description>Analog mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OTYPER</name>
          <displayName>OTYPER</displayName>
          <description>GPIO port output type register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OT15</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT14</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT13</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT12</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT11</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT10</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT9</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT8</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT7</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT6</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT5</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT4</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT3</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT2</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT1</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0.OT0"/>
            </field>
            <field>
              <name>OT0</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OT0</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>PushPull</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpenDrain</name>
                  <description>Output open-drain</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OSPEEDR</name>
          <displayName>GPIOB_OSPEEDR</displayName>
          <description>GPIO port output speed           register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OSPEEDR15</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR14</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR13</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR12</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR11</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR10</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR9</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR8</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR7</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR6</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR5</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR4</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR3</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR2</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR1</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEEDR0.OSPEEDR0"/>
            </field>
            <field>
              <name>OSPEEDR0</name>
              <description>Port x configuration bits (y =               0..15)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>OSPEEDR0</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>LowSpeed</name>
                  <description>Low speed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MediumSpeed</name>
                  <description>Medium speed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HighSpeed</name>
                  <description>High speed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VeryHighSpeed</name>
                  <description>Very high speed</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
