apple/swift-embedded-examples/Tools/SVDs/stm32f7x6.patched.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Ethernet_DMA</name>
      <description>Ethernet: DMA controller operation</description>
      <groupName>Ethernet</groupName>
      <baseAddress>0x40029000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ETH</name>
        <description>Ethernet global interrupt</description>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>ETH_WKUP</name>
        <description>Ethernet Wakeup through EXTI line
        interrupt</description>
        <value>62</value>
      </interrupt>
      <registers>
        <register>
          <name>DMABMR</name>
          <displayName>DMABMR</displayName>
          <description>Ethernet DMA bus mode register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00002101</resetValue>
          <fields>
            <field>
              <name>SR</name>
              <description>Software reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SR</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset all MAC subsystem internal registers and logic. Cleared automatically</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DA</name>
              <description>DMA arbitration</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DA</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>RoundRobin</name>
                  <description>Round-robin with Rx:Tx priority given by PM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxPriority</name>
                  <description>Rx has priority over Tx</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSL</name>
              <description>Descriptor skip length</description>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>EDFE</name>
              <description>Enhanced descriptor format enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EDFE</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Normal descriptor format</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enhanced 32-byte descriptor format, required for timestamping and IPv4 checksum offload</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PBL</name>
              <description>Programmable burst length</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                <name>PBL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>PBL1</name>
                  <description>Maximum of 1 beat per DMA transaction</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PBL2</name>
                  <description>Maximum of 2 beats per DMA transaction</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PBL4</name>
                  <description>Maximum of 4 beats per DMA transaction</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PBL8</name>
                  <description>Maximum of 8 beats per DMA transaction</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PBL16</name>
                  <description>Maximum of 16 beats per DMA transaction</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PBL32</name>
                  <description>Maximum of 32 beats per DMA transaction</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PM</name>
              <description>Rx-Tx priority ratio</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PM</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>OneToOne</name>
                  <description>RxDMA priority over TxDMA is 1:1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TwoToOne</name>
                  <description>RxDMA priority over TxDMA is 2:1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ThreeToOne</name>
                  <description>RxDMA priority over TxDMA is 3:1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FourToOne</name>
                  <description>RxDMA priority over TxDMA is 4:1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FB</name>
              <description>Fixed burst</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FB</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Variable</name>
                  <description>AHB uses SINGLE and INCR burst transfers</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Fixed</name>
                  <description>AHB uses only fixed burst transfers</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDP</name>
              <description>Rx DMA PBL</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                <name>RDP</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>RDP1</name>
                  <description>1 beat per RxDMA transaction</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDP2</name>
                  <description>2 beats per RxDMA transaction</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDP4</name>
                  <description>4 beats per RxDMA transaction</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDP8</name>
                  <description>8 beats per RxDMA transaction</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDP16</name>
                  <description>16 beats per RxDMA transaction</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDP32</name>
                  <description>32 beats per RxDMA transaction</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USP</name>
              <description>Use separate PBL</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>USP</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Combined</name>
                  <description>PBL value used for both Rx and Tx DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Separate</name>
                  <description>RxDMA uses RDP value, TxDMA uses PBL value</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPM</name>
              <description>4xPBL mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FPM</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>x1</name>
                  <description>PBL values used as-is</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>x4</name>
                  <description>PBL values multiplied by 4</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AAB</name>
              <description>Address-aligned beats</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>AAB</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Unaligned</name>
                  <description>Bursts are not aligned</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Aligned</name>
                  <description>Align bursts to start address LS bits. First burst alignment depends on FB bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MB</name>
              <description>Mixed burst</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MB</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Fixed burst transfers (INCRx and SINGLE) for burst lengths of 16 and below</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Mixed</name>
                  <description>If FB is low, start all bursts greater than 16 with INCR (undefined burst)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATPDR</name>
          <displayName>DMATPDR</displayName>
          <description>Ethernet DMA transmit poll demand           register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TPD</name>
              <description>Transmit poll demand</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <name>TPD</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Poll</name>
                  <description>Poll the transmit descriptor list</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARPDR</name>
          <displayName>DMARPDR</displayName>
          <description>EHERNET DMA receive poll demand           register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RPD</name>
              <description>Receive poll demand</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <enumeratedValues>
                <name>RPD</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Poll</name>
                  <description>Poll the receive descriptor list</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARDLAR</name>
          <displayName>DMARDLAR</displayName>
          <description>Ethernet DMA receive descriptor list address           register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRL</name>
              <description>Start of receive list</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATDLAR</name>
          <displayName>DMATDLAR</displayName>
          <description>Ethernet DMA transmit descriptor list           address register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STL</name>
              <description>Start of transmit list</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
