apple/swift-embedded-examples/Tools/SVDs/stm32f7x6.patched.svd
        <register>
          <name>RTSR</name>
          <displayName>RTSR</displayName>
          <description>Rising Trigger selection register           (EXTI_RTSR)</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TR0</name>
              <description>Rising trigger event configuration of               line 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TR0</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Rising edge trigger is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Rising edge trigger is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TR1</name>
              <description>Rising trigger event configuration of               line 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR2</name>
              <description>Rising trigger event configuration of               line 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR3</name>
              <description>Rising trigger event configuration of               line 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR4</name>
              <description>Rising trigger event configuration of               line 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR5</name>
              <description>Rising trigger event configuration of               line 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR6</name>
              <description>Rising trigger event configuration of               line 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR7</name>
              <description>Rising trigger event configuration of               line 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR8</name>
              <description>Rising trigger event configuration of               line 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR9</name>
              <description>Rising trigger event configuration of               line 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR10</name>
              <description>Rising trigger event configuration of               line 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR11</name>
              <description>Rising trigger event configuration of               line 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR12</name>
              <description>Rising trigger event configuration of               line 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR13</name>
              <description>Rising trigger event configuration of               line 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR14</name>
              <description>Rising trigger event configuration of               line 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR15</name>
              <description>Rising trigger event configuration of               line 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR16</name>
              <description>Rising trigger event configuration of               line 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR17</name>
              <description>Rising trigger event configuration of               line 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR18</name>
              <description>Rising trigger event configuration of               line 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR19</name>
              <description>Rising trigger event configuration of               line 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR20</name>
              <description>Rising trigger event configuration of               line 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR21</name>
              <description>Rising trigger event configuration of               line 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR22</name>
              <description>Rising trigger event configuration of               line 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR</name>
          <displayName>FTSR</displayName>
          <description>Falling Trigger selection register           (EXTI_FTSR)</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TR0</name>
              <description>Falling trigger event configuration of               line 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TR0</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Falling edge trigger is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Falling edge trigger is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TR1</name>
              <description>Falling trigger event configuration of               line 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR2</name>
              <description>Falling trigger event configuration of               line 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR3</name>
              <description>Falling trigger event configuration of               line 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR4</name>
              <description>Falling trigger event configuration of               line 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR5</name>
              <description>Falling trigger event configuration of               line 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR6</name>
              <description>Falling trigger event configuration of               line 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR7</name>
              <description>Falling trigger event configuration of               line 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR8</name>
              <description>Falling trigger event configuration of               line 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR9</name>
              <description>Falling trigger event configuration of               line 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR10</name>
              <description>Falling trigger event configuration of               line 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR11</name>
              <description>Falling trigger event configuration of               line 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR12</name>
              <description>Falling trigger event configuration of               line 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR13</name>
              <description>Falling trigger event configuration of               line 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR14</name>
              <description>Falling trigger event configuration of               line 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR15</name>
              <description>Falling trigger event configuration of               line 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR16</name>
              <description>Falling trigger event configuration of               line 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR17</name>
              <description>Falling trigger event configuration of               line 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR18</name>
              <description>Falling trigger event configuration of               line 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR19</name>
              <description>Falling trigger event configuration of               line 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR20</name>
              <description>Falling trigger event configuration of               line 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR21</name>
              <description>Falling trigger event configuration of               line 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
            <field>
              <name>TR22</name>
              <description>Falling trigger event configuration of               line 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TR0.TR0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER</name>
          <displayName>SWIER</displayName>
          <description>Software interrupt event register           (EXTI_SWIER)</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWIER0</name>
              <description>Software Interrupt on line               0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SWIER0W</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Pend</name>
                  <description>Generates an interrupt request</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWIER1</name>
              <description>Software Interrupt on line               1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER2</name>
              <description>Software Interrupt on line               2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER3</name>
              <description>Software Interrupt on line               3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER4</name>
              <description>Software Interrupt on line               4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER5</name>
              <description>Software Interrupt on line               5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER6</name>
              <description>Software Interrupt on line               6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER7</name>
              <description>Software Interrupt on line               7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER8</name>
              <description>Software Interrupt on line               8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER9</name>
              <description>Software Interrupt on line               9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER10</name>
              <description>Software Interrupt on line               10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER11</name>
              <description>Software Interrupt on line               11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER12</name>
              <description>Software Interrupt on line               12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER13</name>
              <description>Software Interrupt on line               13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER14</name>
              <description>Software Interrupt on line               14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER15</name>
              <description>Software Interrupt on line               15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER16</name>
              <description>Software Interrupt on line               16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER17</name>
              <description>Software Interrupt on line               17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER18</name>
              <description>Software Interrupt on line               18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER19</name>
              <description>Software Interrupt on line               19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER20</name>
              <description>Software Interrupt on line               20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER21</name>
              <description>Software Interrupt on line               21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
            <field>
              <name>SWIER22</name>
              <description>Software Interrupt on line               22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="SWIER0.SWIER0W"/>
            </field>
          </fields>
        </register>
